Тема “Работа с данными в Pandas”

Задание 1
Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные: 
[1, 1, 1, 2, 2, 3, 3], 
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники']

In [10]:
import numpy as np
import pandas as pd

In [11]:
authors = pd.DataFrame({'author_id': [1,2,3], 'author_name': ['Tyrgenev', 'Chehov', 'Ostrovsky']}, columns = ['author_id','author_name'])

In [12]:
authors

   author_id author_name
0          1    Tyrgenev
1          2      Chehov
2          3   Ostrovsky

In [13]:
books = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3], 'book_title': ['Fathers and Sons', 'Rydin', 'Dvoryanskoe gnezdo', 'Fat and thin', 'Lady with dog', 'Storm', 'Talents and fans'], 'price': [356, 550, 1200, 1000, 689, 2028, 5056]}, columns = ['author_id', 'book_title', 'price'])

In [14]:
books

   author_id          book_title  price
0          1    Fathers and Sons    356
1          1               Rydin    550
2          1  Dvoryanskoe gnezdo   1200
3          2        Fat and thin   1000
4          2       Lady with dog    689
5          3               Storm   2028
6          3    Talents and fans   5056

Задание 2
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [15]:
authors_price = pd.merge(authors, books, on = 'author_id', how = 'outer')

In [16]:
authors_price

   author_id author_name          book_title  price
0          1    Tyrgenev    Fathers and Sons    356
1          1    Tyrgenev               Rydin    550
2          1    Tyrgenev  Dvoryanskoe gnezdo   1200
3          2      Chehov        Fat and thin   1000
4          2      Chehov       Lady with dog    689
5          3   Ostrovsky               Storm   2028
6          3   Ostrovsky    Talents and fans   5056

Задание 3
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [17]:
top5 = authors_price.nlargest( 5, 'price')

In [18]:
top5

   author_id author_name          book_title  price
6          3   Ostrovsky    Talents and fans   5056
5          3   Ostrovsky               Storm   2028
2          1    Tyrgenev  Dvoryanskoe gnezdo   1200
3          2      Chehov        Fat and thin   1000
4          2      Chehov       Lady with dog    689

Задание 4
Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора,минимальная, максимальная и средняя цена на книги этого автора .

In [19]:
price_agg = authors_price.groupby('author_name').agg({'price':'max'})
price_agg

             price
author_name
Chehov        1000
Ostrovsky     5056
Tyrgenev      1200

In [20]:
price_agg = authors_price.groupby('author_name').agg({'price':'min'})
price_agg

             price
author_name
Chehov         689
Ostrovsky     2028
Tyrgenev       356

In [21]:
price_agg = authors_price.groupby('author_name').agg({'price':'mean'})
price_agg

              price
author_name
Chehov        844.5
Ostrovsky    3542.0
Tyrgenev      702.0

In [22]:
authors_stat = pd.DataFrame ({'author_name': ['Chehov', 'Ostrovsky', 'Tyrgenev'], 
                              'max_price': [1000, 5056, 1200], 
                              'min_price': [689, 2028, 356],
                              'mean_price':[844.5, 3542.0, 702.0]}, 
                              columns = ['author_name', 'max_price', 'min_price', 'mean_price'])

In [23]:
authors_stat

  author_name  max_price  min_price  mean_price
0      Chehov       1000        689       844.5
1   Ostrovsky       5056       2028      3542.0
2    Tyrgenev       1200        356       702.0

Задание 5**
Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].

In [24]:
authors_price ['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [25]:
authors_price

   author_id author_name          book_title  price    cover
0          1    Tyrgenev    Fathers and Sons    356  твердая
1          1    Tyrgenev               Rydin    550   мягкая
2          1    Tyrgenev  Dvoryanskoe gnezdo   1200   мягкая
3          2      Chehov        Fat and thin   1000  твердая
4          2      Chehov       Lady with dog    689  твердая
5          3   Ostrovsky               Storm   2028   мягкая
6          3   Ostrovsky    Talents and fans   5056   мягкая

Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.

In [26]:
?

In [27]:
book_info = pd.pivot_table(authors_price, values='price', index=['author_name'], columns=['cover'], aggfunc=np.sum)
book_info['мягкая'] = book_info['мягкая'].fillna(0)
book_info['твердая'] = book_info['твердая'].fillna(0)

In [28]:
book_info

cover        мягкая  твердая
author_name
Chehov          0.0   1689.0
Ostrovsky    7084.0      0.0
Tyrgenev     1750.0    356.0

Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2.

In [29]:
book_info.to_pickle('book_info.pkl')

In [30]:
book_info2 = pd.read_pickle ('book_info.pkl')

In [32]:
book_info2

cover        мягкая  твердая
author_name
Chehov          0.0   1689.0
Ostrovsky    7084.0      0.0
Tyrgenev     1750.0    356.0

Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [36]:
book_info2.equals(book_info)

True